using System.Configuration;
using System.Data;
using System.Windows;

namespace MedProject_UI
{
    /// <summary>
    /// Interaction logic for App.xaml
    /// </summary>
    public partial class App : Application
    {
        public sealed class DataItem
        {
            //public bool? _colCheckBox { get; set; }
            public string _colCardNumber { get; private set; }
            public string? _colLastName { get; set; }
            public string? _colFirstName { get; set; }
            public string _colMiddleName { get; set; }
            public DateTime _colBirthDay { get; set; }
            public int _colAge
            {
                get
                {
                    return _colBirthDay.Date > DateTime.Today.AddYears(-(DateTime.Today.Year - _colBirthDay.Year))
                        ? DateTime.Today.Year - _colBirthDay.Year - 1
                        : DateTime.Today.Year - _colBirthDay.Year;
                }
            }
            public string? _colAddress { get; set; }
            public string? _colProfession { get; set; }
            public DateTime _colHospitalDate { get; set; }
            public DateTime _colLeaveDate { get; set; }

            public DataItem()
            {
                _colCardNumber = GuidHelper.GenerateShortGuid();

                _colLastName = GetRandomLastName();
                _colFirstName = GetRandomFirstName();
                _colMiddleName = new List<string> { "Олександр", "Сергій", "Дмитро", "Андрій", "Максим", "Владислав", "Євген", "Володимир", "Віталій", "Ігор", "Роман", "Юрій", "Олег", "Артем", "Олексій", "Микола", "Денис", "Іван", "Руслан", "Віктор", "Михайло", "Антон", "Анатолій", "Станіслав", "Богдан", "Вадим", "В'ячеслав", "Павло", "Ярослав", "Валерій", "Костянтин", "Василь", "Данило", "Артур", "Микита", "Валентин", "Ілля", "Ростислав", "Кирило", "Едуард", "Тарас", "Єгор", "Петро", "Назар", "Геннадій", "Григорій", "Леонід", "Борис", "Георгій", "Тимур" }.IndexOf(_colFirstName) >= 0
                        ? new List<string> { "Олександрович", "Андрійович", "Сергійович", "Вікторович", "Іванович", "Михайлович", "Володимирович", "Юрійович", "Петрович", "Романович", "Вадимович", "Тарасович", "Артемович", "Денисович", "Богданович", "Євгенович", "Ігорович", "Олегович", "Дмитрович", "Павлович", "Максимович", "Анатолійович", "Костянтинович", "Васильович", "Леонідович", "Олексійович", "Валерійович", "Ростиславович", "Борисович", "Святославович", "Григорійович", "Антонович", "Юліанович", "Кирилович", "Тимофійович", "Владиславович", "В’ячеславович", "Захарович", "Станіславович", "Єгорович", "Назарович", "Федорович", "Рустамович", "Геннадійович", "Валентинович", "Євгенійович", "Віталійович", "Богуславович", "Мирославович", "Данилович", "Ярославович", "Веніамінович", "Захарович", "Святославович", "Романович", "Борисович", "Гаврилович", "Ілліч", "Левкович", "Миронович", "Назарович", "Опанасович", "Пантелеймонович", "Радіонович", "Семенович", "Теодорович", "Устимович", "Харитонович", "Юхимович", "Якимович", "Захарович", "Назарович", "Рустамович", "Євгенович", "Борисович", "Віталійович", "Анатолійович", "Артемович", "Богданович", "Денисович", "Кирилович", "Костянтинович", "Максимович", "Миколайович", "Назарович", "Олександрович", "Петропавлович", "Ростиславович", "Сергійович", "Тарасович", "Федорович", "Харитонович", "Юхимович", "Ярославович", "Валентинович", "Іванович", "Юрійович", "Вікторович", "Олегович", "Павлович" }[new Random().Next(0, 99)]
                        : new List<string> { "Олександрівна", "Андріївна", "Сергіївна", "Вікторівна", "Іванівна", "Михайлівна", "Володимирівна", "Юріївна", "Петрівна", "Романівна", "Вадимівна", "Тарасівна", "Артемівна", "Денисівна", "Богданівна", "Євгенівна", "Ігорівна", "Олегівна", "Дмитрівна", "Павлівна", "Максимівна", "Анатоліївна", "Костянтинівна", "Василівна", "Леонідівна", "Олексіївна", "Валеріївна", "Ростиславівна", "Борисівна", "Святославівна", "Григоріївна", "Антонівна", "Юліанівна", "Кирилівна", "Тимофіївна", "Владиславівна", "В’ячеславівна", "Захарівна", "Станіславівна", "Єгорівна", "Назарівна", "Федорівна", "Рустамівна", "Геннадіївна", "Валентинівна", "Євгеніївна", "Віталіївна", "Богуславівна", "Мирославівна", "Данилівна", "Ярославівна", "Веніамінівна", "Захарівна", "Святославівна", "Романівна", "Борисівна", "Гаврилівна", "Іллівна", "Левківна", "Миронівна", "Назарівна", "Опанасівна", "Пантелеймонівна", "Радіонівна", "Семенівна", "Теодорівна", "Устимівна", "Харитонівна", "Юхимівна", "Якимівна", "Захарівна", "Назарівна", "Рустамівна", "Євгенівна", "Борисівна", "Віталіївна", "Анатоліївна", "Артемівна", "Богданівна", "Денисівна", "Кирилівна", "Костянтинівна", "Максимівна", "Миколаївна", "Назарівна", "Олександрівна", "Петропавлівна", "Ростиславівна", "Сергіївна", "Тарасівна", "Федорівна", "Харитонівна", "Юхимівна", "Ярославівна", "Валентинівна", "Іванівна", "Юріївна", "Вікторівна", "Олегівна", "Павлівна" }[new Random().Next(0, 99)];
            }
        }

        private List<DataItem> dataItems = new List<DataItem>();

        private static string GetRandomLastName()
        {
            List<string> lastNames = new List<string>();
            lastNames.AddRange(["Мельник", "Шевченко", "Коваленко", "Бондаренко", "Бойко", "Ткаченко", "Кравченко", "Ковальчук", "Коваль", "Олійник", "Шевчук", "Поліщук", "Івановарос", "Ткачук", "Савченко", "Бондар", "Марченко", "Руденко", "Мороз", "Лисенко", "Петренко", "Клименко", "Павленко", "Кравчук", "Івановрос", "Кузьменко", "Пономаренко", "Савчук", "Василенко", "Левченко", "Харченко", "Сидоренко", "Карпенко", "Гаврилюк", "Швець", "Мельничук", "Поповарос", "Романюк", "Панченко", "Юрченко", "Мазур", "Хоменко", "Попович", "Павлюк", "Кушнірїд", "Литвиненко", "Мартинюк", "Гончаренко", "Приходько", "Костенко", "Кулик", "Романенко", "Костюк", "Семенюк", "Назаренко", "Ткач", "Кравець", "Коломієць", "Козак", "Яковенко", "Федоренко", "Ковтун", "Білоус", "Нестеренко", "Терещенко", "Колесник", "Поповрос", "Зінченко", "Тарасенко", "Міщенко", "Вовк", "Демченко", "Дяченко", "Ковальоварос", "Пилипенко", "Іщенко", "Макаренко", "Бабенко", "Кириченко", "Тищенко", "Тимошенко", "Жук", "Москаленко", "Марчук", "Власенко", "Гуменюк", "Яценко", "Радченко", "Герасименко", "Сергієнко", "Корнієнко", "Гончар", "Мартиненко", "Гордієнко", "Степаненко", "Прокопенко", "Шульга", "Волошин", "Величко", "Денисенко"]);
            return lastNames[new Random().Next(0, 99)];
        }

        private static string GetRandomFirstName()
        {
            List<string> firstNames = new List<string>();
            firstNames.AddRange(["Олександр", "Сергій", "Дмитро", "Андрій", "Максим", "Владислав", "Євген", "Володимир", "Віталій", "Ігор", "Роман", "Юрій", "Олег", "Артем", "Олексій", "Микола", "Денис", "Іван", "Руслан", "Віктор", "Михайло", "Антон", "Анатолій", "Станіслав", "Богдан", "Вадим", "В'ячеслав", "Павло", "Ярослав", "Валерій", "Костянтин", "Василь", "Данило", "Артур", "Микита", "Валентин", "Ілля", "Ростислав", "Кирило", "Едуард", "Тарас", "Єгор", "Петро", "Назар", "Геннадій", "Григорій", "Леонід", "Борис", "Георгій", "Тимур", "Наталя", "Тетяна", "Юлія", "Анна", "Олена", "Ірина", "Вікторія", "Марина", "Анастасія", "Ольга", "Катерина", "Світлана", "Аліна", "Людмила", "Альона", "Оксана", "Яніна", "Марія", "Дар'я", "Інна", "Олександра", "Валентина", "Ксенія", "Валерія", "Карина", "Євгенія", "Надія", "Алла", "Лариса", "Лілія", "Єлизавета", "Діана", "Леся", "Любов", "Галина", "Вероніка", "Віталія", "Христина", "Анжеліка", "Владислава", "Маргарита", "Ніна", "Ілона", "Поліна", "Софія", "Тамара", "Лідія", "Жанна", "Антоніна", "Віра"]);
            return firstNames[new Random().Next(0, 99)];
        }

        private static string GetRandomStreet()
        {
            List<string> adresses = new List<string>();
            adresses.AddRange(["Абрикосова", "Ананасна", "Смородинова", "Малинова", "Сунична", "Порічкова", "Зелена", "Огіркова", "Баклажанна", "Виноградна", "Калинова", "Медова", "Плодова", "Фруктова", "Шовковична", "Ягідна", "Яблунева", "Бузинова", "Бузкова", "Вербна", "Волошкова", "Зелена", "Каштанова", "Липова", "Липська", "Осокорська", "Проліскова", "Пшенична", "Тополина", "Фіалкова", "Ялинкова", "Дібровна", "Джерельна", "Долинна", "Залісна", "Залужна", "Зарічна", "Левадна", "Лісова", "Лугова", "Нагірна", "Над’ярна", "Озерна", "Паркова", "Підгірна", "Підлісна", "Приозерна", "Прирічна", "Польова", "Річна", "Садова", "Синьоозерна", "Ставкова", "Багряна дуброва", "Золоті джерела", "Квіткові луки", "Клейова долина", "Березнева", "Вереснева", "Весняна", "Зимова", "Квітнева", "Липнева", "Листопадна", "Літня", "Осіння", "Серпнева", "Травнева", "1 Травня", "9 Травня", "Введенська", "Воздвиженська", "Воскресенська", "Покровська", "Стрітенська", "Фестивальна", "Відпочинку", "Дачна", "Добрий Шлях", "Добросусідська", "Дружня", "Живописна", "Затишна", "Золота", "Зоряна", "Квітуча", "Курортна", "Лазурна", "Мальовнича", "Миру", "Привітна", "Радісна", "Райдужна", "Рожева", "Світла", "Сонячна", "Спокійна", "Творча", "Тиха", "Успішна"]);
            return $"вул. {adresses[new Random().Next(0, 99)]}, {new Random().Next(1, 199)}";
        }

        private static string GetRandomProfession()
        {
            List<string> professions = new List<string>();
            professions.AddRange(["Онлайн-терапевт", "Оператор віддаленої хірургії", "Експерт з індивідуальної фармакології", "Персональний менеджер з мікробіому людини", "Розробник кіберпротезів та імплантів", "Спеціаліст з імплантів мозку", "Творець частин тіла й органів", "Інженер-генетик", "Спеціаліст з біохакінгу і програмованого здоров’я", "Оператор медичних роботів", "Архітектор живих систем", "Інженер у галузі синтетичної біології", "Проєктувальник кіберорганізмов", "Творець мікроорганізмів із заданими функціями", "Фахівець з відродження вимерлих видів", "Агрокібернетик", "Інженер з 3D-друку продуктів харчування", "Оператор автоматизованої сільгосптехніки", "Сіті-фермер", "Фахівець зі штучного вирощування м’яса", "Оператор «розумної» переробки сміття", "Інженер з управління погодою", "Фахівець зі зміни клімату", "Експерт з точного прогнозу землетрусів", "Консультант з альтернативних видів енергії", "Оператор підземних дронів-прохідників", "Розробник систем мікрогенераціі енергії", "Дизайнер портативних енергоприладів", "Фахівець з керованого термоядерного синтезу", "Архітектор «зелених» міст", "Проєктувальник інфраструктури «розумного» будинку", "Будівельник підводних міст", "Архітектор енергоавтономних будівель", "Проєктувальник 3D-друку в будівництві", "Проєктувальник нових видів транспорту", "Автозаправник альтернативними видами палива", "Розробник «розумних» доріг", "Професійний пілот дрона", "Оператор автономних морських суден", "Інструктор летючих автомобілів", "Регулювальник руху безпілотного автотранспорту", "Юрист у сфері безпілотного транспорту", "Наноінженер", "Розробник «розумних» і композитних матеріалів", "Проєктувальник нанороботів", "Нанокриміналіст", "Дизайнер «розумного» одягу та взуття", "Техностиліст", "Персональний кравець для 3D-друку одягу", "Інженер домашніх роботів", "Проєктувальник роботів для дітей", "Розробник медичних роботів", "Творець бойових роботів", "Юрист у сфері робототехніки", "Розробник інтернету речей", "Фахівець у сфері квантових обчислень", "Квантовий криптолог", "Проєктувальник нейроінтерфейсів", "Інженер з оцифрування і зберігання пам’яті", "Консультант зі зняття цифрової залежності", "Творець цифрових двійників", "Фахівець з ІТ-та ШІ-етики", "Утилізатор цифрового сміття у сфері Big Data", "Проєктувальник особистої безпеки", "Фахівець з кібербезпеки", "Знищувач цифрових слідів", "Контролер достовірності новинного контенту (медіаполіцейський)", "Активатор корпоративного конкурентного середовища", "Консультант з цифрової трансформації компаній", "Операціоніст криптовалютного банку", "Оцінювач інтелектуальної власності", "Тайм-брокер", "Експерт з блокчейн-розвитку бізнесу", "Автор освітніх курсів на базі ШІ", "Інтегратор міждисциплінарних знань", "Експерт з «образу майбутнього» дитини", "Персональний гід з освіти і кар’єрного зростання", "Програміст бот-вчителів", "Тренер з майнд-фітнесу", "Експерт з пошуку і розвитку талантів", "Дизайнер віртуальної реальності", "Інженер доповненої реальності", "ШІ-композитор", "ШІ-письменник", "ШІ-художник", "Оператор голографічного мовлення", "Продюсер телепрограм змішаної реальності", "Агрегатор персональних новин (narrowcaster)", "Психолог з адаптації до нової реальності", "Мережевий юрист", "Цифровий лінгвіст-перекладач", "Експерт з взаємодії людей і машин", "Менеджер з відстроченої старості", "Пілот комерційних космічних кораблів", "Гід у сфері космічного туризму", "Розробник корисних копалин у космосі", "Прибиральник космічного сміття", "Космобіолог", "Проєктувальник позаземних поселень", "Спеціаліст з тераформування планет"]);
            return professions[new Random().Next(0, 99)];
        }

        protected override void OnStartup(StartupEventArgs e)
        {
            base.OnStartup(e);

            for (int i = 0; i < 100000; i++)
            {
                dataItems.Add(new DataItem
                {
                    //_colCheckBox = false,
                    _colBirthDay = DateTime.Now.AddYears(new Random().Next(16, 50) * -1)
                                               .AddMonths(new Random().Next(1, 12) * -1)
                                               .AddDays(new Random().Next(1, 28) * -1)
                                               .AddHours(new Random().Next(1, 23) * -1)
                                               .AddMinutes(new Random().Next(1, 59) * -1)
                                               .AddSeconds(new Random().Next(1, 59) * -1),
                    _colAddress = GetRandomStreet(),
                    _colProfession = GetRandomProfession(),
                    _colHospitalDate = DateTime.Now.AddYears(new Random().Next(1, 3) * -1)
                                                   .AddMonths(new Random().Next(1, 12) * -1)
                                                   .AddDays(new Random().Next(0, 28) * -1)
                                                   .AddHours(new Random().Next(0, 23) * -1)
                                                   .AddMinutes(new Random().Next(0, 59) * -1)
                                                   .AddSeconds(new Random().Next(0, 59) * -1),
                    _colLeaveDate = DateTime.Now.AddMonths(new Random().Next(1, 12) * -1)
                                                .AddDays(new Random().Next(0, 28) * -1)
                                                .AddHours(new Random().Next(0, 23) * -1)
                                                .AddMinutes(new Random().Next(0, 59) * -1)
                                                .AddSeconds(new Random().Next(0, 59) * -1)
                });
            }
        }

        public List<DataItem> GetDataItems()
        {
            return dataItems;
        }
    }

}
